In [52]:
import pandas as pd
import sqlite3

In [53]:
im_conn = sqlite3.connect("../data/im.db")

In [54]:
bom_df = pd.read_csv("../zippedData/bom.movie_gross.csv.gz")
bom_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [55]:
movieinfo_df = pd.read_csv("../zippedData/rt.movie_info.tsv.gz", sep='\t', compression='gzip')
movieinfo_df.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [56]:
reviews_df = pd.read_csv(
    "../zippedData/rt.reviews.tsv.gz",
    sep='\t',
    compression='gzip',
    encoding='latin1'   # or encoding='ISO-8859-1'
)
reviews_df.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [57]:
tmdb_df = pd.read_csv("../zippedData/tmdb.movies.csv.gz")
tmdb_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [58]:
budgets_df = pd.read_csv("../zippedData/tn.movie_budgets.csv.gz")
budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

Basic Cleaning

In [59]:
# check shape and missing values for all datasets

datasets = {
    "BOM": bom_df,
    "Movie Info": movieinfo_df,
    "Reviews": reviews_df,
    "TMDB": tmdb_df,
    "Budgets": budgets_df
}

for name, df in datasets.items():
    print(f"\n{name} dataset: {df.shape[0]} rows, {df.shape[1]} columns")
    print("Missing values summary:")
    display(df.isnull().sum().sort_values(ascending=True).head(10))

BOM dataset: 3387 rows, 5 columns
Missing values summary:

title                0
year                 0
studio               5
domestic_gross      28
foreign_gross     1350
dtype: int64

Movie Info dataset: 1560 rows, 12 columns
Missing values summary:

id                 0
rating             3
genre              8
runtime           30
synopsis          62
director         199
theater_date     359
dvd_date         359
writer           449
studio          1066
dtype: int64

Reviews dataset: 54432 rows, 8 columns
Missing values summary:

id                0
fresh             0
top_critic        0
date              0
publisher       309
critic         2722
review         5563
rating        13517
dtype: int64

TMDB dataset: 26517 rows, 10 columns
Missing values summary:

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

Budgets dataset: 5782 rows, 6 columns
Missing values summary:

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [60]:
#drop duplicates

for name, df in datasets.items():
    df.drop_duplicates(inplace=True)

In [61]:
# this helps you identify if numeric columns like budgets or grosses are stored as text

for name, df in datasets.items():
    display(df.dtypes)

title              object
studio             object
domestic_gross    float64
foreign_gross      object
year                int64
dtype: object

id               int64
synopsis        object
rating          object
genre           object
director        object
writer          object
theater_date    object
dvd_date        object
currency        object
box_office      object
runtime         object
studio          object
dtype: object

id             int64
review        object
rating        object
fresh         object
critic        object
top_critic     int64
publisher     object
date          object
dtype: object

Unnamed: 0             int64
genre_ids             object
id                     int64
original_language     object
original_title        object
popularity           float64
release_date          object
title                 object
vote_average         float64
vote_count             int64
dtype: object

id                    int64
release_date         object
movie                object
production_budget    object
domestic_gross       object
worldwide_gross      object
dtype: object

In [ ]:
# Remove $ and commas, convert to integer

for col in ["production_budget", "domestic_gross", "worldwide_gross"]:
    budgets_df[col] = (budgets_df[col].replace('[\$,]', '', regex=True).astype(float))

budgets_df[["production_budget", "domestic_gross", "worldwide_gross"]].head()

   production_budget  domestic_gross  worldwide_gross
0        425000000.0     760507625.0     2.776345e+09
1        410600000.0     241063875.0     1.045664e+09
2        350000000.0      42762350.0     1.497624e+08
3        330600000.0     459005868.0     1.403014e+09
4        317000000.0     620181382.0     1.316722e+09

In [63]:
# Make column names consistent across datasets; all lowercase, no spaces.

bom_df.columns = bom_df.columns.str.lower().str.replace(" ", "_")

movieinfo_df.columns = movieinfo_df.columns.str.lower().str.replace(" ", "_")

reviews_df.columns = reviews_df.columns.str.lower().str.replace(" ", "_")

tmdb_df.columns = tmdb_df.columns.str.lower().str.replace(" ", "_")

budgets_df.columns = budgets_df.columns.str.lower().str.replace(" ", "_")

Loading Cleaned Data into SQLite

In [64]:
# Create a new database (or connect if exists)
conn = sqlite3.connect("../data/movies_cleaned.db")

# Save each dataframe as a SQL table

bom_df.to_sql("bom_gross", conn, if_exists="replace", index=False)

movieinfo_df.to_sql("rt_movie_info", conn, if_exists="replace", index=False)

reviews_df.to_sql("rt_reviews", conn, if_exists="replace", index=False)

tmdb_df.to_sql("tmdb_movies", conn, if_exists="replace", index=False)

budgets_df.to_sql("movie_budgets", conn, if_exists="replace", index=False)

print("Cleaned datasets loaded into SQLite database successfully!")

Cleaned datasets loaded into SQLite database successfully!

In [65]:
# verification of tables in SQLite

pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)

            name
0      bom_gross
1  rt_movie_info
2     rt_reviews
3    tmdb_movies
4  movie_budgets

In [71]:
pd.read_sql("PRAGMA table_info(rt_movie_info);", conn)

    cid          name     type  notnull dflt_value  pk
0     0            id  INTEGER        0       None   0
1     1      synopsis     TEXT        0       None   0
2     2        rating     TEXT        0       None   0
3     3         genre     TEXT        0       None   0
4     4      director     TEXT        0       None   0
5     5        writer     TEXT        0       None   0
6     6  theater_date     TEXT        0       None   0
7     7      dvd_date     TEXT        0       None   0
8     8      currency     TEXT        0       None   0
9     9    box_office     TEXT        0       None   0
10   10       runtime     TEXT        0       None   0
11   11        studio     TEXT        0       None   0

In [72]:
for table in ["bom_gross", "rt_reviews", "tmdb_movies", "movie_budgets"]:
    print(f"\n{table} columns:")
    display(pd.read_sql(f"PRAGMA table_info({table});", conn))

bom_gross columns:

   cid            name     type  notnull dflt_value  pk
0    0           title     TEXT        0       None   0
1    1          studio     TEXT        0       None   0
2    2  domestic_gross     REAL        0       None   0
3    3   foreign_gross     TEXT        0       None   0
4    4            year  INTEGER        0       None   0

rt_reviews columns:

   cid        name     type  notnull dflt_value  pk
0    0          id  INTEGER        0       None   0
1    1      review     TEXT        0       None   0
2    2      rating     TEXT        0       None   0
3    3       fresh     TEXT        0       None   0
4    4      critic     TEXT        0       None   0
5    5  top_critic  INTEGER        0       None   0
6    6   publisher     TEXT        0       None   0
7    7        date     TEXT        0       None   0

tmdb_movies columns:

   cid               name     type  notnull dflt_value  pk
0    0         unnamed:_0  INTEGER        0       None   0
1    1          genre_ids     TEXT        0       None   0
2    2                 id  INTEGER        0       None   0
3    3  original_language     TEXT        0       None   0
4    4     original_title     TEXT        0       None   0
5    5         popularity     REAL        0       None   0
6    6       release_date     TEXT        0       None   0
7    7              title     TEXT        0       None   0
8    8       vote_average     REAL        0       None   0
9    9         vote_count  INTEGER        0       None   0

movie_budgets columns:

   cid               name     type  notnull dflt_value  pk
0    0                 id  INTEGER        0       None   0
1    1       release_date     TEXT        0       None   0
2    2              movie     TEXT        0       None   0
3    3  production_budget     REAL        0       None   0
4    4     domestic_gross     REAL        0       None   0
5    5    worldwide_gross     REAL        0       None   0

OBJECTIVE 1: Identify High-Performing Studios & Genres

We start by finding which studios consistently produce the highest grossing movies. 
 
The `bom_gross` and `movie_budgets` tables are used here.

In [74]:
query_studio_performance = """
SELECT
    bg.studio,
    ROUND(AVG(mb.worldwide_gross), 2) AS avg_worldwide_gross,
    COUNT(mb.movie) AS num_movies
FROM movie_budgets mb
JOIN bom_gross bg
    ON mb.movie = bg.title
GROUP BY bg.studio
HAVING num_movies > 3
ORDER BY avg_worldwide_gross DESC
LIMIT 10;
"""

studio_performance_df = pd.read_sql(query_studio_performance, conn)
studio_performance_df

    studio  avg_worldwide_gross  num_movies
0     P/DW         5.078028e+08          10
1       BV         4.623058e+08          72
2      Fox         2.435983e+08         110
3     Sony         2.378623e+08          74
4     Uni.         2.335837e+08         117
5  WB (NL)         2.308342e+08          37
6       WB         2.175864e+08         102
7     Par.         1.951109e+08          74
8     LG/S         1.230944e+08          31
9     Sum.         1.198865e+08          12

OBJECTIVE 2: Analyzing ROI (Profitability)

This calculate each movies ROI to identify which films and studios achieve the best returns.

In [75]:
query_roi = """
SELECT
    mb.movie,
    bg.studio,
    ROUND((mb.worldwide_gross - mb.production_budget) / mb.production_budget, 2) AS ROI,
    mb.worldwide_gross,
    mb.production_budget
FROM movie_budgets mb
JOIN bom_gross bg
    ON mb.movie = bg.title
WHERE mb.production_budget > 0
ORDER BY ROI DESC
LIMIT 10;
"""

roi_df = pd.read_sql(query_roi, conn)
roi_df

                   movie   studio     ROI  worldwide_gross  production_budget
0            The Gallows  WB (NL)  415.56       41656474.0           100000.0
1       The Devil Inside     Par.  100.76      101759490.0          1000000.0
2              Insidious       FD   65.58       99870886.0          1500000.0
3             Unfriended     Uni.   63.36       64364198.0          1000000.0
4  Paranormal Activity 2     Par.   58.17      177512032.0          3000000.0
5                  Split     Uni.   54.79      278964806.0          5000000.0
6                Get Out     Uni.   50.07      255367951.0          5000000.0
7      Chernobyl Diaries       WB   41.41       42411721.0          1000000.0
8  Paranormal Activity 3     Par.   40.41      207039844.0          5000000.0
9              Annabelle  WB (NL)   38.52      256862920.0          6500000.0

OBJECTIVE 3: Audience Ratings and Popularity

This shows which genres and types of films receive high audience ratings and votes using TMDb data.

In [76]:
query_ratings = """
SELECT
    tm.genre_ids,
    ROUND(AVG(tm.vote_average), 2) AS avg_rating,
    COUNT(*) AS num_movies
FROM tmdb_movies tm
GROUP BY tm.genre_ids
HAVING num_movies > 5
ORDER BY avg_rating DESC
LIMIT 10;
"""

ratings_df = pd.read_sql(query_ratings, conn)
ratings_df

         genre_ids  avg_rating  num_movies
0  [37, 18, 10402]       10.00           6
1  [99, 18, 10751]        8.13           7
2  [99, 36, 10402]        7.89           8
3  [99, 36, 10770]        7.80           6
4     [53, 16, 14]        7.80           6
5  [10402, 99, 36]        7.67           6
6      [10402, 18]        7.42          27
7  [14, 16, 10751]        7.41           7
8         [99, 80]        7.35          12
9      [10751, 99]        7.32           6

OBJECTIVE 4: Movie Performance Trends Over Time

Well explore whether movie performance has improved or declined over time, based on box office and budgets.

In [77]:
query_trends = """
SELECT
    bg.year,
    ROUND(AVG(mb.worldwide_gross), 2) AS avg_gross,
    ROUND(AVG(mb.production_budget), 2) AS avg_budget,
    COUNT(*) AS num_movies
FROM movie_budgets mb
JOIN bom_gross bg
    ON mb.movie = bg.title
GROUP BY bg.year
HAVING num_movies > 5
ORDER BY bg.year ASC;
"""

trends_df = pd.read_sql(query_trends, conn)
trends_df.head()

   year     avg_gross   avg_budget  num_movies
0  2010  1.027785e+08  38876128.53         184
1  2011  1.199072e+08  43302827.38         168
2  2012  1.467869e+08  46617118.06         144
3  2013  1.607725e+08  51617857.14         140
4  2014  1.617406e+08  45311776.35         128

OBJECTIVE 5: Identify Top Performing Movies

This involves finding the most profitable and highest rated movies across all sources.

In [78]:
query_best_movies = """
SELECT
    mb.movie,
    bg.studio,
    tm.vote_average AS rating,
    ROUND((mb.worldwide_gross - mb.production_budget) / mb.production_budget, 2) AS ROI,
    mb.worldwide_gross
FROM movie_budgets mb
JOIN bom_gross bg
    ON mb.movie = bg.title
JOIN tmdb_movies tm
    ON mb.movie = tm.title
WHERE mb.production_budget > 0
ORDER BY ROI DESC, rating DESC
LIMIT 10;
"""

best_movies_df = pd.read_sql(query_best_movies, conn)
best_movies_df

                   movie   studio  rating     ROI  worldwide_gross
0            The Gallows  WB (NL)     4.8  415.56       41656474.0
1       The Devil Inside     Par.     4.7  100.76      101759490.0
2              Insidious       FD     6.9   65.58       99870886.0
3             Unfriended     Uni.     5.4   63.36       64364198.0
4  Paranormal Activity 2     Par.     5.7   58.17      177512032.0
5                  Split     Uni.     7.2   54.79      278964806.0
6                  Split     Uni.     5.3   54.79      278964806.0
7                  Split     Uni.     5.0   54.79      278964806.0
8                  Split     Uni.     4.8   54.79      278964806.0
9                Get Out     Uni.     7.5   50.07      255367951.0

**SQL INSIGHTS**


**Top Studios:** The most successful studios generate high worldwide grosses consistently.  

**ROI Leaders:** Low-budget, high-grossing films show strong profit potential.  

**Ratings:** Some genres (from TMDb `genre_ids`) correlate with higher average audience ratings. 

**Trends:** Movie budgets and grosses have shifted over years, showing changing audience interests.  

**Top Titles:** Combining ROI and ratings highlights films that are both profitable and popular.